In [23]:
import numpy as np
import pandas as pd
import math

In [24]:
df=pd.read_csv('raw_data.csv')

In [25]:
df

,math score,reading score,writing score,Placement Score,placement offer count
0,72.000000,72.00,74.0,78.000,1
1,69.000000,90.00,88.0,62.125,2
2,90.000000,95.00,93.0,74.000,2
3,47.000000,57.00,77.0,78.000,1
4,52.285714,78.00,75.0,81.000,3
5,71.000000,72.25,78.0,70.000,4
6,12.000000,44.00,52.0,12.000,2
7,52.285714,65.00,67.0,49.000,1
8,5.000000,77.00,89.0,55.000,0

In [26]:
df.describe(
)

,math score,reading score,writing score,Placement Score,placement offer count
count,9.000000,9.000000,9.0000,9.000000,9.000000
mean,52.285714,72.250000,77.0000,62.125000,1.777778
std,28.123452,15.698328,12.5499,21.791268,1.201850
min,5.000000,44.000000,52.0000,12.000000,0.000000
25%,47.000000,65.000000,74.0000,55.000000,1.000000
50%,52.285714,72.250000,77.0000,70.000000,2.000000
75%,71.000000,78.000000,88.0000,78.000000,2.000000
max,90.000000,95.000000,93.0000,81.000000,4.000000

In [27]:
def mean_value(variable):
    sum_value=df[variable].sum()
    count_value=df[variable].count()
    return sum_value/count_value

In [28]:
mean_value('math score')

52.28571422222222

In [29]:
def median_value(variable):
    middle_index=math.floor(df[variable].count()/2)
    return np.sort(df[variable])[middle_index]

In [30]:
median_value('math score')

52.285714

In [31]:
mean_value('reading score')

72.25

In [32]:
median_value('reading score')

72.25

In [33]:
mean_value('writing score')

77.0

In [34]:
median_value('writing score')

77.0

In [42]:
def std_dev(variable):
    lst=[]
    count_values=df[variable].count()
    mean1=df[variable].mean()
    for i in range(count_values):
        sigma=(df[variable][i]-mean1)**2
        lst.append(sigma)
    return np.sqrt(sum(lst)/count_values)

In [43]:
std_dev('reading score')

14.800525516195549

In [44]:
df['reading score'].std()

15.6983279364396